package com.example.genericparadigmdemo.paradigm.array;

public class Father {

    public B f1(B obj){
        System.out.println("Father.f1()");
        return new B();
    }

}
/**
 * xunxun寻寻觅觅谈搜寻：信息的不对称性
 * 众里寻他千百度。蓦然回首，那人却在，灯火阑珊处。
 *          ---《青玉案*元夕》，辛弃疾（1140-1207）
 *          寻寻觅觅本来就是人类生活与生存的一部分。在远古时代，人类觅食以渔猎为主。
 *          随着猎物的减少，人类需要话费越来越多的时间与精力寻找与捕获猎物。搜寻渐渐
 *          成为人类生活的大事，从阿拉斯加因纽特人海上捕猎鲸鱼🐳就可以看出来。
 *
 *          随着人类文明的发展，农耕社会的形成降低了粮食供应的不确定性，更重要的是，
 *          粮食的供应原则上不再需要寻寻觅觅,就在自己家的前院后园里。
 *          人们可以把时间及精力放在农耕技术与问题的解决上，粮食问题得到根本解决，
 *          人口数量也快速增加。
 *          当人类社会由农业社会转成工业社会后，人与人之间互动更多，分工更加精细，原来
 *          农业社会中较少发生的寻觅问题，再次浮现后面。如今，在信息不对称下，搜寻问题更
 *          显得重要。在今日的社会里，人们无时无刻不在搜寻信息。我们饿了要找餐厅，走累了
 *          要找公交车，还常要找朋友联络，找玩伴，也要找好玩的地方。找找找，寻寻复觅觅，
 *          已是人类生活不可或缺的一部分，它是必要之恶，但也存在无限商机。
 *
 */
